wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_rdcm.h
/* bits definitions */
/* RDCM_CS */
#define RDCM_CS_RDCMEN                   BIT(0)                                    /*!< RDCM module enable */
#define RDCM_CS_CALSEL                   BITS(1,2)                                 /*!< RDCM main chain calculation event selection */
#define RDCM_CS_GATEVSEL                 BITS(3,4)                                 /*!< Result valid trigger gate selection */
#define RDCM_CS_TRKERRTHMS               BITS(5,6)                                 /*!< Tracking error signal threshold mode selection */
#define RDCM_CS_TRKERRTHMIE              BIT(7)                                    /*!< Track error signal threshold match interrupt enable */
#define RDCM_CS_MTHIE                    BIT(8)                                    /*!< Monitor signal threshold match interrupt enable */
#define RDCM_CS_QETHMIE                  BIT(9)                                    /*!< Q channel envelope signal threshold match interrupt enable */
#define RDCM_CS_IETHMIE                  BIT(10)                                   /*!< I channel envelope signal threshold match interrupt enable */
#define RDCM_CS_QZCDIE                   BIT(11)                                   /*!< Q channel zero crossing detection valid interrupt enable */
#define RDCM_CS_IZCDIE                   BIT(12)                                   /*!< I channel zero crossing detection valid interrupt enable */
#define RDCM_CS_TSCAPIE                  BIT(13)                                   /*!< Timestamp counter capture valid interrupt enable */
#define RDCM_CS_OVIE                     BIT(14)                                   /*!< RDC-DMA transfer overflow interrupt enable */
#define RDCM_CS_RESDIE                   BIT(15)                                   /*!< Result valid (Result update or result fifo level) interrupt enable */
#define RDCM_CS_MTHMS                    BITS(17,18)                               /*!< Monitor signal mode selection */
#define RDCM_CS_QETHMS                   BITS(19,20)                               /*!< Q channel envelope signal threshold mode selection */
#define RDCM_CS_IETHMS                   BITS(21,22)                               /*!< I channel envelope signal threshold mode selection */
#define RDCM_CS_TRKERRTHMIF              BIT(23)                                   /*!< Track error signal threshold match interrupt flag */
#define RDCM_CS_MTHMIF                   BIT(24)                                   /*!< Monitor signal threshold match interrupt flag */
#define RDCM_CS_QETHMIF                  BIT(25)                                   /*!< Q channel envelope signal threshold match interrupt flag */
#define RDCM_CS_IETHMIF                  BIT(26)                                   /*!< I channel envelope signal threshold match interrupt flag */
#define RDCM_CS_QZCDIF                   BIT(27)                                   /*!< Q channel zero crossing detection interrupt flag */
#define RDCM_CS_IZCDIF                   BIT(28)                                   /*!< I channel zero crossing detection interrupt flag */
#define RDCM_CS_TSCAPIF                  BIT(29)                                   /*!< Timestamp counter capture interrupt flag */
#define RDCM_CS_OVIF                     BIT(30)                                   /*!< DMA transfer data register overflow interrupt flag */
#define RDCM_CS_RESDIF                   BIT(31)                                   /*!< Result data interrupt flag */

/* RDCM_CTL */
#define RDCM_CTL_IRFMEN                  BIT(0)                                    /*!< I channel reference frequency mixer enable */
#define RDCM_CTL_IDEMEN                  BIT(1)                                    /*!< I channel demodulator enable */
#define RDCM_CTL_IDEMRST                 BIT(2)                                    /*!< I channel demodulator reset */
#define RDCM_CTL_IZCDMS                  BITS(3,4)                                 /*!< Zero crossing detection mode selection */
#define RDCM_CTL_CALETM                  BITS(5,6)                                 /*!< External trigger mode for RDC main chain calculation (HF filter, demodulator, tracking loop) */
#define RDCM_CTL_TSCAPETM                BITS(7,8)                                 /*!< External trigger mode for timestamp counter capture */
#define RDCM_CTL_TRKERRTHMEN             BIT(9)                                    /*!< Track error signal threshold match function enable */
#define RDCM_CTL_MTHMEN                  BIT(10)                                   /*!< Monitor signal threshold match function enable */
#define RDCM_CTL_QETHMEN                 BIT(11)                                   /*!< Q channel envelope signal threshold match function enable */
#define RDCM_CTL_IETHMEN                 BIT(12)                                   /*!< I channel envelope signal threshold match function enable */
#define RDCM_CTL_TSCAPEN                 BIT(13)                                   /*!< Timestamp counter capture function enable */
#define RDCM_CTL_FIFOEN                  BIT(14)                                   /*!< Result fifo enable */
#define RDCM_CTL_OVDEN                   BIT(15)                                   /*!< RDC-DMA transfer overflow function enable */
#define RDCM_CTL_QRFMEN                  BIT(16)                                   /*!< Q channel reference frequency mixer enable */
#define RDCM_CTL_QDEMEN                  BIT(17)                                   /*!< Q channel demodulator enable */
#define RDCM_CTL_QDEMRST                 BIT(18)                                   /*!< Q channel demodulator reset */
#define RDCM_CTL_QZCDMS                  BITS(19,20)                               /*!< Zero crossing detection mode selection in Q channel */
#define RDCM_CTL_NCOETM                  BITS(22,23)                               /*!< External trigger mode for all NCOs(Excitor, I/Q Reference Frequency Mixer) calculation */
#define RDCM_CTL_NCORST                  BIT(24)                                   /*!< Reset the phase of all NCOs (Exciter and I/Q reference frequency mixer) to the initial setting phase */
#define RDCM_CTL_EXCEN                   BIT(25)                                   /*!< Sinusoidal exciter enable */
#define RDCM_CTL_TRKEN                   BIT(26)                                   /*!< Track loop enable */
#define RDCM_CTL_RESDSEL                 BITS(27,29)                               /*!< DMA transfer/clearing DUPF used data register selection */
#define RDCM_CTL_DDSM                    BIT(30)                                   /*!< DMA disable mode */
#define RDCM_CTL_DMAEN                   BIT(31)                                   /*!< DMA request enable */

/* RDCM_EXCFG0 */
#define RDCM_EXCFG0_FEXC                 BITS(0,13)                                /*!< Frequency of the exciter */
#define RDCM_EXCFG0_PEXC                 BITS(16,29)                               /*!< Initial phase of the exciter */

/* RDCM_EXCFG1 */
#define RDCM_EXCFG1_AEXC                 BITS(0,12)                                /*!< Amplitude of the exciter */
#define RDCM_EXCFG1_NCODIV               BITS(16,29)                               /*!< NCO(Excitror,I/Q reference frequency mixer) calculation frequency division factor */

