wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_rdcm.h
/* RDCM_HFCFG0 */
#define RDCM_HFCFG0_IOFFSET              BITS(0,14)                                /*!< I channel offset factor */
#define RDCM_HFCFG0_IHFM                 BITS(16,18)                               /*!< I channel high-pass (offset compensation) filter mode */

/* RDCM_HFCFG1 */
#define RDCM_HFCFG1_QOFFSET              BITS(0,14)                                /*!< Q channel offset factor */
#define RDCM_HFCFG1_QHFM                 BITS(16,18)                               /*!< Q channel high-pass (offset compensation) filter mode */

/* RDCM_RFMCFG0 */
#define RDCM_RFMCFG0_IPHASE              BITS(0,13)                                /*!< Initial phase of the I channel reference frequency mixer */
#define RDCM_RFMCFG0_IFRE                BITS(16,29)                               /*!< The frequency control word of the I channel reference frequency mixer */

/* RDCM_RFMCFG1 */
#define RDCM_RFMCFG1_QPHASE              BITS(0,13)                                /*!< Initial phase of the Q channel reference frequency mixer */
#define RDCM_RFMCFG1_QFRE                BITS(16,29)                               /*!< The frequency control word of the Q channel reference frequency mixer */

/* RDCM_ZTCFG0 */
#define RDCM_ZTCFG0_IZCTH                BITS(0,13)                                /*!< The threshold of mismatch counter value in zero crossing detection of I channel */
#define RDCM_ZTCFG0_QZCTH                BITS(16,29)                               /*!< The threshold of mismatch counter value in zero crossing detection of Q channel */

/* RDCM_ZTCFG1 */
#define RDCM_ZTCFG1_IZTVAR               BITS(0,13)                                /*!< The threshold variation range of mismatch counter value in zero crossing detection of I channel */
#define RDCM_ZTCFG1_QZTVAR               BITS(16,29)                               /*!< The threshold variation range of mismatch counter value in zero crossing detection of Q channel */

/* RDCM_MCACFG */
#define RDCM_MCACFG_IAVEM                BITS(0,3)                                 /*!< The mismatch counter average factor of I channel */
#define RDCM_MCACFG_QAVEM                BITS(16,19)                               /*!< The mismatch counter average factor of Q channel */

/* RDCM_DEMCFG */
#define RDCM_DEMCFG_IFIR0EN              BIT(0)                                    /*!< I channel FIR0 filter enable */
#define RDCM_DEMCFG_IFIR1EN              BIT(1)                                    /*!< I channel FIR1 filter enable */
#define RDCM_DEMCFG_IFIR1DEC             BIT(2)                                    /*!< I channel FIR1 filter decimation rate */
#define RDCM_DEMCFG_ICIC3EN              BIT(3)                                    /*!< I channel CIC3 filter enable */
#define RDCM_DEMCFG_QFIR0EN              BIT(16)                                   /*!< Q channel FIR0 filter enable */
#define RDCM_DEMCFG_QFIR1EN              BIT(17)                                   /*!< Q channel FIR1 filter enable */
#define RDCM_DEMCFG_QFIR1DEC             BIT(18)                                   /*!< Q channel FIR1 filter decimation rate */
#define RDCM_DEMCFG_QCIC3EN              BIT(19)                                   /*!< Q channel CIC3 filter enable */

/* RDCM_CSGCFG0 */
#define RDCM_CSGCFG0_IGAIN               BITS(0,12)                                /*!< I channel gain factor */
#define RDCM_CSGCFG0_ICICSHIFT           BITS(16,21)                               /*!< I channel output shift */

/* RDCM_CSGCFG1 */
#define RDCM_CSGCFG1_QGAIN               BITS(0,12)                                /*!< Q channel gain factor */
#define RDCM_CSGCFG1_QCICSHIFT           BITS(16,21)                               /*!< Q channel output shift */

/* RDCM_CICCFG0 */
#define RDCM_CICCFG0_ICICDFAC            BITS(0,8)                                 /*!< I channel CIC3 filter oversampling rate */
#define RDCM_CICCFG0_ICICSVAL            BITS(16,24)                               /*!< I channel CIC3 filter decimation counter load value */

/* RDCM_CICCFG1 */
#define RDCM_CICCFG1_QCICDFAC            BITS(0,8)                                 /*!< Q channel CIC3 filter oversampling rate */
#define RDCM_CICCFG1_QCICSVAL            BITS(16,24)                               /*!< Q channel CIC3 filter decimation counter load value */

/* RDCM_CDCNT */
#define RDCM_CDCNT_ICICDCNT              BITS(0,8)                                 /*!< I channel CIC Filter Decimation Counter */
#define RDCM_CDCNT_QCICDCNT              BITS(16,24)                               /*!< Q channel CIC3 filter decimation counter */

/* RDCM_NPMCFG */
#define RDCM_NPMCFG_XFAC                 BITS(0,15)                                /*!< Q channel nonorthogonal phase mismatch compsensation factor X */
#define RDCM_NPMCFG_YFAC                 BITS(16,31)                               /*!< Q channel nonorthogonal phase mismatch compsensation factor Y */

/* RDCM_TRKGAINCFG */
#define RDCM_TRKGAINCFG_TRKERRGAIN       BITS(0,28)                                /*!< The error acceleration gain factor */

/* RDCM_TRKINTCFG */
#define RDCM_TRKINTCFG_VINTGAIN          BITS(0,4)                                 /*!< The velocity gain factor of integrator */
#define RDCM_TRKINTCFG_PINTGAIN          BITS(16,20)                               /*!< The position gain factor of integrator */

/* RDCM_TRKCMPCFG */
#define RDCM_TRKCMPCFG_POLE              BITS(0,14)                                /*!< The pole of compensation filter */
#define RDCM_TRKCMPCFG_ZERO              BITS(16,30)                               /*!< The zero of compensation filter */

/* RDCM_VSFCFG */
#define RDCM_VSFCFG_VSFM                 BITS(0,3)                                 /*!< The velocity smooth filter mode in tracking loop */

/* RDCM_HFDATA */
#define RDCM_HFDATA_IHFDATA              BITS(0,15)                                /*!< Data output from I channel high pass filter */
#define RDCM_HFDATA_QHFDATA              BITS(16,31)                               /*!< Data output from Q channel high pass filter */

/* RDCM_RFMDATA */
#define RDCM_RFMDATA_IRFMDATA            BITS(0,15)                                /*!< Data output from I channel reference frequency mixer */
#define RDCM_RFMDATA_QRFMDATA            BITS(16,31)                               /*!< Data output from Q channel reference frequency mixer */

