wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_rdcm.h
/* tracking error signal threshold mode selection */
#define TRKERRTHMS(regval)              (BITS(5,6) & ((uint32_t)(regval) << 5))
#define RDCM_TRKERRTHMS_RANGE           TRKERRTHMS(0)                              /*!< TRKERRTHL[14:0] < Tracking error signal value < TRKERRTHU[14:0] */
#define RDCM_TRKERRTHMS_OUT_RANGE       TRKERRTHMS(1)                              /*!< Tracking error signal value < TRKERRTHL[14:0] or TRKERRTHU[14:0] < Tracking error signal value */
#define RDCM_TRKERRTHMS_GREATER         TRKERRTHMS(2)                              /*!< TRKERRTHL[14:0] < Tracking error signal value */
#define RDCM_TRKERRTHMS_LESS            TRKERRTHMS(3)                              /*!< TRKERRTHL[14:0] > Tracking error signal value */

/* I channel envelope signal threshold mode selection */
#define IETHMS(regval)                  (BITS(21,22) & ((uint32_t)(regval) << 21))
#define RDCM_IETHMS_RANGE               IETHMS(0)                                  /*!< IETHL[14:0] < I channel envelope signal value < IETHU[14:0] */
#define RDCM_IETHMS_OUT_RANGE           IETHMS(1)                                  /*!< I channel envelope signal value < IETHL[14:0] or IETHU[14:0] < I channel envelope signal value */
#define RDCM_IETHMS_GREATER             IETHMS(2)                                  /*!< IETHL[14:0] < I channel envelope signal value */
#define RDCM_IETHMS_LESS                IETHMS(3)                                  /*!< IETHL[14:0] > I channel envelope signal value */

/* Q channel envelope signal threshold mode selection */
#define QETHMS(regval)                  (BITS(19,20) & ((uint32_t)(regval) << 19))
#define RDCM_QETHMS_RANGE               QETHMS(0)                                  /*!< QETHL[14:0] < Q channel envelope signal value < QETHU[14:0] */
#define RDCM_QETHMS_OUT_RANGE           QETHMS(1)                                  /*!< Q channel envelope signal value < QETHL[14:0] or QETHU[14:0] < Q channel envelope signal value */
#define RDCM_QETHMS_GREATER             QETHMS(2)                                  /*!< QETHL[14:0] < Q channel envelope signal value */
#define RDCM_QETHMS_LESS                QETHMS(3)                                  /*!< QETHL[14:0] > Q channel envelope signal value */

/* monitor signal mode selection */
#define MTHMS(regval)                   (BITS(17,18) & ((uint32_t)(regval) << 17))
#define RDCM_MTHMS_OUT_RANGE            MTHMS(0)                                   /*!< monitor signal value < MTHL[14:0] or MTHU[14:0] < monitor signal value */
#define RDCM_MTHMS_RANGE                MTHMS(1)                                   /*!< MTHL[14:0] < monitor signal value < MTHU[14:0] */
#define RDCM_MTHMS_GREATER              MTHMS(2)                                   /*!< MTHL[14:0] > monitor signal vibration value */
#define RDCM_MTHMS_LESS                 MTHMS(3)                                   /*!< MTHL[14:0] < monitor signal vibration value */

/* RDCM result data register selection */
#define RESDSEL(regval)                 (BITS(27,29) & ((uint32_t)(regval) << 27))
#define RDCM_RESDSEL_TRKDATA            RESDSEL(0)                                 /*!< RDCM_TRKDATA */
#define RDCM_RESDSEL_HFDATA             RESDSEL(1)                                 /*!< RDCM_HFDATA */
#define RDCM_RESDSEL_RFMDATA            RESDSEL(2)                                 /*!< RDCM_RFMDATA */
#define RDCM_RESDSEL_DEMDATA            RESDSEL(3)                                 /*!< RDCM_DEMDATA */
#define RDCM_RESDSEL_MONDATA            RESDSEL(4)                                 /*!< RDCM_MONDATA */
#define RDCM_RESDSEL_POSDATA            RESDSEL(5)                                 /*!< RDCM_POSDATA */
#define RDCM_RESDSEL_VELDATA            RESDSEL(6)                                 /*!< RDCM_VELDATA */

/* zero crossing detection mode selection in I channel */
#define IZCDMS(regval)                  (BITS(3,4) & ((uint32_t)(regval) << 3))
#define RDCM_IZCDMS_DISABLE             IZCDMS(0)                                  /*!< zero crossing detection is disabled (manual reference frequency mixer phase adjust) */
#define RDCM_IZCDMS_POSITIVE            IZCDMS(1)                                  /*!< positive zero crossing detection mode (only for calibration) */
#define RDCM_IZCDMS_NEGATIVE            IZCDMS(2)                                  /*!< negative zero crossing detection mode (only for calibration) */
#define RDCM_IZCDMS_BOTH                IZCDMS(3)                                  /*!< both positive and negative zero crossing detection mode (automatic reference frequency mixer phase adjust) */

/* zero crossing detection mode selection in Q channel */
#define QZCDMS(regval)                  (BITS(19,20) & ((uint32_t)(regval) << 19))
#define RDCM_QZCDMS_DISABLE             QZCDMS(0)                                  /*!< zero crossing detection is disabled (manual reference frequency mixer phase adjust) */
#define RDCM_QZCDMS_POSITIVE            QZCDMS(1)                                  /*!< positive zero crossing detection mode (only for calibration) */
#define RDCM_QZCDMS_NEGATIVE            QZCDMS(2)                                  /*!< negative zero crossing detection mode (only for calibration) */
#define RDCM_QZCDMS_BOTH                QZCDMS(3)                                  /*!< both positive and negative zero crossing detection mode (automatic reference frequency mixer phase adjust) */

/* external trigger mode for timestamp counter capture */
#define TSCAPETM(regval)                (BITS(7,8) & ((uint32_t)(regval) << 7))
#define RDCM_TSCAPETM_DISABLE           TSCAPETM(0)                                /*!< disable trigger for timestamp counter capture */
#define RDCM_TSCAPETM_RISING            TSCAPETM(1)                                /*!< rising edge of external trigger for timestamp counter capture */
#define RDCM_TSCAPETM_FALLING           TSCAPETM(2)                                /*!< falling edge of external trigger for timestamp counter capture */
#define RDCM_TSCAPETM_BOTH              TSCAPETM(3)                                /*!< rising and falling edge of external trigger for timestamp counter capture */

/* external trigger mode for all NCOs calculation */
#define NCOETM(regval)                  (BITS(22,23) & ((uint32_t)(regval) << 22))
#define RDCM_NCOETM_DIVISION            NCOETM(0)                                  /*!< calculation according to the NCO division of CK_RDCM */
#define RDCM_NCOETM_RISING              NCOETM(1)                                  /*!< rising edge of external trigger for all NCOs calculation */
#define RDCM_NCOETM_FALLING             NCOETM(2)                                  /*!< falling edge of external trigger for all NCOs calculation */
#define RDCM_NCOETM_BOTH                NCOETM(3)                                  /*!< rising and falling edge of external trigger for all NCOs calculation */

