wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_rdcm.h
/* RDCM NCO phase functions */
/* reset the phase of all NCOs (Exciter and I/Q reference frequency mixer) to the initial setting phase */
void rdcm_excitor_rfm_phase_reset(void);

/* RDCM timestamp functions */
/* enable timestamp counter capture */
void rdcm_timestamp_counter_capture_enable(void);
/* disable timestamp counter capture */
void rdcm_timestamp_counter_capture_disable(void);
/* configure timestamp trigger mode */
void rdcm_timestamp_trigger_mode_config(uint32_t mode);
/* configure timestamp counter clock */
void rdcm_timestamp_counter_clock_config(uint32_t clock);
/* read timestamp counter value */
uint16_t rdcm_timestamp_counter_value_read(void);
/* read the most recent captured timestamp value */
uint16_t rdcm_timestamp_capture_value_read(void);

/* RDCM FIFO functions */
/* enable result data fifo */
void rdcm_result_data_fifo_enable(void);
/* disable result data fifo */
void rdcm_result_data_fifo_disable(void);
/* configure FIFO result event */
void rdcm_fifo_result_event_config(uint32_t event);
/* flush result data fifo */
void rdcm_result_data_fifo_flush(void);
/* read FIFO valid data number */
uint8_t rdcm_fifo_valid_num_read(void);
/* read FIFO data */
uint32_t rdcm_fifo_data_read(void);

/* RDCM threshold match functions */
/* enable RDCM envelope signal threshold match */
void rdcm_envelope_signal_threshold_match_enable(uint32_t channel);
/* disable RDCM envelope signal threshold match */
void rdcm_envelope_signal_threshold_match_disable(uint32_t channel);
/* enable RDCM monitor signal threshold match */
void rdcm_monitor_signal_threshold_match_enable(void);
/* disable RDCM monitor signal threshold match */
void rdcm_monitor_signal_threshold_match_disable(void);
/* enable RDCM track error signal threshold match */
void rdcm_track_error_signal_threshold_match_enable(void);
/* disable RDCM track error signal threshold match */
void rdcm_track_error_signal_threshold_match_disable(void);
/* configure RDCM envelope signal threshold match mode */
void rdcm_envelope_signal_threshold_match_mode_config(uint32_t i_mode, uint32_t q_mode);
/* configure RDCM monitor signal threshold match mode */
void rdcm_monitor_signal_threshold_match_mode_config(uint32_t mode);
/* configure RDCM track error signal threshold match mode */
void rdcm_track_error_signal_threshold_match_mode_config(uint32_t mode);
/* configure RDCM envelope signal threshold */
void rdcm_envelope_signal_threshold_config(uint32_t channel, int32_t upper, int32_t lower);
/* configure RDCM monitor signal threshold */
void rdcm_monitor_signal_threshold_config(int32_t upper, int32_t lower);
/* configure RDCM track error signal threshold */
void rdcm_track_error_signal_threshold_config(int32_t upper, int32_t lower);
/* configure RDCM track error signal threshold match counter value */
void rdcm_track_error_signal_threshold_match_counter_config(uint32_t cnt);
/* configure RDCM monitor signal threshold match counter value */
void rdcm_monitor_signal_threshold_match_counter_config(uint32_t cnt);

/* gate signal configuration */
/* configure gate signal (timestamp trigger) valid level */
void rdcm_gate_signal_valid_level_config(uint32_t level);

/* channel data configuration */
/* configure I/Q channel data offset */
void rdcm_channel_data_offset_config(uint32_t channel, int32_t offset);
/* read I/Q channel CIC3 decimation counter */
uint16_t rdcm_cic3_decimation_counter_read(uint32_t channel);
/* read I/Q channel high pass filter data */
int16_t rdcm_high_pass_filter_data_read(uint32_t channel);
/* read I/Q channel reference frequency mixer data */
int16_t rdcm_reference_frequency_mixer_data_read(uint32_t channel);
/* read I/Q channel demodulator data */
int16_t rdcm_demodulator_data_read(uint32_t channel);

/* RDCM data read functions */
/* read track loop velocity data */
int16_t rdcm_track_velocity_data_read(void);
/* read track loop position data */
int16_t rdcm_track_position_data_read(void);
/* read track error signal data */
int16_t rdcm_track_error_signal_data_read(void);
/* read monitor signal data */
int16_t rdcm_monitor_signal_data_read(void);
/* read position data */
int16_t rdcm_position_read(void);
/* read velocity data */
int16_t rdcm_velocity_read(void);

/* RDCM simulation functions */
/* configure simulation I/Q channel data */
void rdcm_simulation_data_config(uint32_t i_data, uint32_t q_data);
/* configure reference frequency mixer sign data input source */
void rdcm_rfm_sign_input_source_config(uint32_t i_source, uint32_t q_source);
/* configure channel data input source */
void rdcm_channel_data_input_source_config(uint32_t source);

/* RDCM flag and interrupt functions */
/* get RDCM flag */
FlagStatus rdcm_flag_get(rdcm_flag_enum flag);
/* clear RDCM flag */
void rdcm_flag_clear(rdcm_flag_enum flag);
/* enable RDCM interrupt */
void rdcm_interrupt_enable(uint32_t interrupt);
/* disable RDCM interrupt */
void rdcm_interrupt_disable(uint32_t interrupt);
/* get RDCM interrupt flag */
FlagStatus rdcm_interrupt_flag_get(uint32_t flag);
/* clear RDCM interrupt flag */
void rdcm_interrupt_flag_clear(uint32_t flag);

#endif /* GD32H77X_RDCM_H */